Enums/ИспользованиеШаблоновСообщенийПриПодбореПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИспользованиеШаблоновСообщенийПриПодбореПерсонала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСВакансией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобрениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭтапаРаботыСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашениеНаЭлектронноеТестирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРедактированияЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Видеособеседования/Ext/Module.bsl
//@Strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Использование - Булево
Процедура ПриИзмененииИспользованияПодсистемы(Использование) Экспорт
	
	Если Использование Тогда
		СоздатьШаблоныСообщений();
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ПараметрыПланируемогоЭтапа - Структура
Процедура ДополнитьПараметрыПланируемогоЭтапа(ПараметрыПланируемогоЭтапа) Экспорт
	
	Если Видеоконференции.ИспользуютсяВидеоконференции() Тогда
		ПараметрыПланируемогоЭтапа.Вставить("СсылкаНаВидеоконференцию", "");
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ЭтапРаботы - Структура
//  ПараметрыПланируемогоЭтапа - Структура
Процедура ЗаполнитьПараметрыПланируемогоЭтапа(ЭтапРаботы, ПараметрыПланируемогоЭтапа) Экспорт
	
	Если Видеоконференции.ИспользуютсяВидеоконференции() Тогда
		ПараметрыПланируемогоЭтапа.СсылкаНаВидеоконференцию = ЭтапРаботы.СсылкаНаВидеоконференцию;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Параметры - Структура
//  Описание - Строка
Процедура ДополнитьОписаниеПланируемогоЭтапа(Параметры, Описание) Экспорт
	
	Если Видеоконференции.ИспользуютсяВидеоконференции() Тогда
		СсылкаНаВидеоконференцию = Параметры.СсылкаНаВидеоконференцию;
		
		Если ЗначениеЗаполнено(СсылкаНаВидеоконференцию) Тогда
			Описание = СтрШаблон(НСтр("ru = '%1
									|
									|Встреча в видеоформате. Ссылка для участия:
									|%2'"), 
								Описание, СсылкаНаВидеоконференцию);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  РеквизитыЭтапа - СтрокаДереваЗначений
Процедура ДополнитьШаблонСообщения(РеквизитыЭтапа) Экспорт
	
	Если Видеоконференции.ИспользуютсяВидеоконференции() Тогда
		// Ссылка на видеоконференцию.
		НоваяСтрока = РеквизитыЭтапа.Добавить();
		НоваяСтрока.Имя = "ЭтапРаботы.СсылкаНаВидеоконференцию";
		НоваяСтрока.Представление = НСтр("ru = 'Ссылка на видеоконференцию'");
		
		// Ссылка на видеоконференцию для кандидата.
		НоваяСтрока = РеквизитыЭтапа.Добавить();
		НоваяСтрока.Имя = "ЭтапРаботы.СсылкаНаВидеоконференциюДляКандидата";
		НоваяСтрока.Представление = НСтр("ru = 'Ссылка на видеоконференцию (для кандидата)'");
		
		// Сервис видеоконференции.
		НоваяСтрока = РеквизитыЭтапа.Добавить();
		НоваяСтрока.Имя = "ЭтапРаботы.СервисВидеоконференции";
		НоваяСтрока.Представление = НСтр("ru = 'Сервис видеоконференции'");
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  РеквизитыЭтапа - Структура
//  ПараметрыСообщения - Структура:
// * СсылкаНаВидеоконференцию - Строка
// * СсылкаНаВидеоконференциюДляКандидата - Строка
// * СервисВидеоконференции - Строка
Процедура ЗаполнитьЗначенияРеквизитовШаблонаСообщения(РеквизитыЭтапа, ПараметрыСообщения) Экспорт
	
	Если Видеоконференции.ИспользуютсяВидеоконференции() Тогда
		РеквизитыЭтапа.Вставить("СсылкаНаВидеоконференцию",
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСообщения, "СсылкаНаВидеоконференцию", ""));
		РеквизитыЭтапа.Вставить("СсылкаНаВидеоконференциюДляКандидата",
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСообщения, "СсылкаНаВидеоконференциюДляКандидата", ""));
		РеквизитыЭтапа.Вставить("СервисВидеоконференции",
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСообщения, "СервисВидеоконференции", ""));
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДлительнаяОперацияСозданияВидеособеседования(Параметры, УникальныйИдентификатор) Экспорт
	
	НастройкиВидеоконференции = НастройкиВидеоконференции(Параметры);
	
	ИмяПроцедуры = "Видеоконференции.СоздатьВидеоконференцию";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		УникальныйИдентификатор, ИмяПроцедуры, Параметры.УчетнаяЗапись, НастройкиВидеоконференции);
	
КонецФункции

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДлительнаяОперацияОбновленияВидеособеседования(Параметры, УникальныйИдентификатор) Экспорт
	
	НастройкиВидеоконференции = НастройкиВидеоконференции(Параметры);
	
	ИмяПроцедуры = "Видеоконференции.ОбновитьВидеоконференцию";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		УникальныйИдентификатор, ИмяПроцедуры, Параметры.УчетнаяЗапись, НастройкиВидеоконференции);
	
КонецФункции

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Булево
Функция ПользовательЯвляетсяУчастником(Параметры, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	НастройкиВидеоконференции = ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции();
	
	ДобавитьПользователейВУчастники(
		НастройкиВидеоконференции.Участники, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Пользователь));
	
	Возврат Видеоконференции.ПользовательЯвляетсяУчастником(
		Параметры.УчетнаяЗапись,
		Параметры.Идентификатор,
		ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НастройкиВидеоконференции.Участники[0]));
	
КонецФункции

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
//  Пользователь - СправочникСсылка.Пользователи
Процедура ДобавитьПользователяВУчастники(Параметры, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	НастройкиВидеоконференции = ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции();
	
	ДобавитьПользователейВУчастники(
		НастройкиВидеоконференции.Участники, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Пользователь));
	
	Видеоконференции.ДобавитьПользователяВУчастники(
		Параметры.УчетнаяЗапись,
		Параметры.Идентификатор,
		ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НастройкиВидеоконференции.Участники[0]));
	
КонецПроцедуры

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ВидеоконференцииПоКандидату(Параметры) Экспорт
	
	Возврат ПодборПерсонала.ВидеоконференцииПоКандидату(Параметры.УчетнаяЗапись, Параметры.Кандидат);
	
КонецФункции

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
Процедура ОтменитьВидеоконференцииПоКандидату(Параметры) Экспорт
	
	Если Не ПодборПерсонала.ОтменитьВидеоконференцииПоКандидату(
		Параметры.Кандидат, Параметры.УчетнаяЗапись, Параметры.Идентификатор) Тогда
		ВызватьИсключение ВидеоконференцииСлужебный.ТекстИсключения(
			НСтр("ru = 'Не удалось отменить видеоконференции по кандидату.'"));
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Параметры - См. ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования
// 
// Возвращаемое значение:
//  Структура - Данные пересечений видеоконференций:
// * ЕстьПересечения - Булево -
// * Предупреждение - Строка -
Функция ДанныеПересеченийВидеоконференций(Параметры) Экспорт
	
	ДанныеОПересечениях = Новый Структура("ЕстьПересечения, Предупреждение", Ложь, "");
	
	Если Видеоконференции.ДанныеСервиса(Параметры.УчетнаяЗапись).ДоступноПланирование Тогда
		ДанныеПересеченияВидеоконференций = ПодборПерсонала.ДанныеПересеченияВидеоконференций(
			Параметры.УчетнаяЗапись, Параметры.Начало, Параметры.Окончание);
		
		Если ДанныеПересеченияВидеоконференций.ЕстьПересечения Тогда
			ДанныеОПересечениях.ЕстьПересечения = Истина;
			
			ДанныеОПересечениях.Предупреждение = 
				СтрШаблон(НСтр("ru = 'Невозможно запланировать видеоконференцию для выбранной учетной записи. 
								|Время занято для этапа ""%1 (%2)"", %3 с %4 до %5'"), 
								ДанныеПересеченияВидеоконференций.ЭтапРаботы,
								ДанныеПересеченияВидеоконференций.Кандидат,
								Формат(ДанныеПересеченияВидеоконференций.Начало, НСтр("ru = 'ДЛФ=D'")),
								Формат(ДанныеПересеченияВидеоконференций.Начало, НСтр("ru = 'ДФ=HH:mm'")),
								Формат(ДанныеПересеченияВидеоконференций.Окончание, НСтр("ru = 'ДФ=HH:mm'")));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеОПересечениях;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиВидеоконференции(Параметры)
	
	НастройкиВидеоконференции = ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции();
	
	ДанныеКандидата = ДанныеКандидата(Параметры.Кандидат);
	
	НастройкиВидеоконференции.Тема = СтрШаблон("%1 (%2)",
		Параметры.Этап,
		ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеКандидата.ФИО));
	
	НастройкиВидеоконференции.Начало = Параметры.Начало;
	НастройкиВидеоконференции.Продолжительность = (Параметры.Окончание - Параметры.Начало) / 60;
	НастройкиВидеоконференции.Идентификатор = Параметры.Идентификатор;
	
	ДобавитьПользователейВУчастники(
		НастройкиВидеоконференции.Участники, Параметры.Участники);
	
	ДобавитьКандидатаВУчастники(НастройкиВидеоконференции.Участники, ДанныеКандидата);
	
	НастройкиВидеоконференции.Участники = ОбщегоНазначения.ТаблицаЗначенийВМассив(НастройкиВидеоконференции.Участники);
	
	Возврат НастройкиВидеоконференции;
	
КонецФункции

Процедура ДобавитьПользователейВУчастники(Участники, Пользователи)
	
	ДанныеПользователей = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		Пользователи, "Наименование,ФизическоеЛицо,ИдентификаторПользователяИБ");
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Пользователь Из Пользователи Цикл
		ДанныеПользователя = ДанныеПользователей[Пользователь];
		
		ДанныеУчастника = Участники.Добавить();
		
		Если ЗначениеЗаполнено(ДанныеПользователя.ФизическоеЛицо) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеУчастника, ДанныеФизическогоЛица(ДанныеПользователя.ФизическоеЛицо));
		Иначе
			ДанныеУчастника.ФИО = ДанныеПользователя.Наименование;
			ДанныеУчастника.Представление = ДанныеПользователя.Наименование;
			ДанныеУчастника.АдресЭП = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		КонецЕсли;
		
		ДанныеУчастника.ИдентификаторПользователяИБ = ДанныеПользователя.ИдентификаторПользователяИБ;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьКандидатаВУчастники(Участники, ДанныеКандидата)
	
	ЗаполнитьЗначенияСвойств(Участники.Добавить(), ДанныеКандидата);
	
КонецПроцедуры

Функция ДанныеФизическогоЛица(ФизическоеЛицо)
	
	ДанныеФизическогоЛица = Новый Структура("ФИО,Представление,АдресЭП");
	
	ДанныеФизическогоЛица.ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");
	ДанныеФизическогоЛица.Представление = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеФизическогоЛица.ФИО);
	ДанныеФизическогоЛица.АдресЭП = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	
	Возврат ДанныеФизическогоЛица;
	
КонецФункции

Функция ДанныеКандидата(Кандидат)
	
	Результат = Новый Структура();
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат);
	
	Если Не ЗначениеЗаполнено(ДанныеКандидата.EMail) Тогда
		ВызватьИсключение НСтр("ru = 'Чтобы пригласить кандидата заполните адрес его электронной почты'");
	КонецЕсли;
	
	Результат.Вставить("ФИО", ДанныеКандидата.ФИО);
	Результат.Вставить("Представление", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеКандидата.ФИО));
	Результат.Вставить("АдресЭП", ДанныеКандидата.EMail);
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьШаблоныСообщений()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШаблоныСообщений.Ссылка
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.ВладелецШаблона = ЗНАЧЕНИЕ(Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом)
	|	И (ШаблоныСообщений.ТекстШаблонаПисьма ПОДОБНО ""%СервисВидеоконференции%""
	|	ИЛИ ШаблоныСообщений.ТекстШаблонаПисьмаHTML ПОДОБНО ""%СервисВидеоконференции%"")
	|	И НЕ ШаблоныСообщений.ПометкаУдаления";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
	
	// Приглашение на видеособеседование (для кандидата).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент") 
		И Не ПолучитьФункциональнуюОпцию("ОтправлятьПисьмаВФорматеHTML") Тогда
		ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	КонецЕсли;
	ПараметрыШаблона.Тема = НСтр("ru = 'Приглашение на видеособеседование'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Кандидаты.ФизическоеЛицо.Имя] [Кандидаты.ФизическоеЛицо.Отчество]!
			|
			|Наша компания [Кандидаты.Организация.Наименование] получила ваш отклик на вакансию «[Кандидаты.Вакансия]».
			|Мы внимательно ознакомились с вашим резюме. Считаем, что ваши знания и навыки соответствуют заявленным требованиям. 
			|
			|Приглашаем вас пройти видеособеседование [ЭтапРаботы.Дата] в [ЭтапРаботы.Время] в сервисе «[ЭтапРаботы.СервисВидеоконференции]».
			|
			|Ссылка на видеоконференцию:
			|
			|[ЭтапРаботы.СсылкаНаВидеоконференциюДляКандидата]
			|
			|С уважением, служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Приглашение на видеособеседование (для кандидата)'"), ПараметрыШаблона);
	
	// АПК:1223-вкл.
	
КонецПроцедуры

#КонецОбласти
